---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexBuffer.Dispose
source: html/b20fe037-d539-7b78-25ca-fa9841e57eba.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexBuffer.Dispose Method

Releases all resources used by the IndexBuffer

## Syntax (C#)
```csharp
public void Dispose()
```